IdeaRS.Connections
DissipativeItemCommandData Properties
Compatible with IDEA StatiCa 0.0
The DissipativeItemCommandData type exposes the following members.
Properties
Name | Description
DissipativePartPaths
 List of connection parts responsible for dissipating of energy occured during sesmic situation.
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Setting
Top
See Also
Reference
DissipativeItemCommandData Class
IdeaRS.Connections.Data Namespace